'''Условия Корректности Поля Судоку (9x9):
1. Строки: В каждой из 9 строк цифры от '1' до '9' могут встречаться не более одного раза.
Пустые ячейки (обозначены символом '.') игнорируются.
2. Столбцы: В каждом из 9 столбцов цифры от '1' до '9' также встречаются не более одного раза.
3.  Квадраты 3x3: Каждый из 9 непересекающихся квадратов 3x3 (малых квадратов)
должен содержать цифры от '1' до '9' не более одного раза.

❗️ Важно: Поле должно быть корректным по этим правилам,
но оно не обязательно должно быть решаемым или полностью заполненным.
Мы проверяем только текущее состояние на соответствие правилам.

🎯 Задача:
Написать функцию, например, is_valid_sudoku(board: list[list[str]]) -> bool,
которая принимает на вход поле 9x9 (список списков строк) и возвращает True,
если поле корректно, и False в противном случае.'''

board = [
  ["5","3",".",".","7",".",".",".","."],
  ["6",".",".","1","9","5",".",".","."],
  [".","9","8",".",".",".",".","6","."],
  ["8",".",".",".","6",".",".",".","3"],
  ["4",".",".","8",".","3",".",".","1"],
  ["7",".",".",".","2",".",".",".","6"],
  [".","6",".",".",".",".","2","8","."],
  [".",".",".","4","1","9",".",".","5"],
  [".",".",".",".","8",".",".","7","9"]
]

def is_valid_sudoku_pythonic(board):
    res = []
    for i, row in enumerate(board):
        for j, num in enumerate(row):
            if num != '.':
                res += [(i, num),
                        (num, j),
                        (i // 3, j // 3, num)]

    return len(res) == len(set(res))
print(is_valid_sudoku_pythonic(board))